var myData = [
	{
		title: "Artificial muscle",
		summary: 'Artificial muscle is a generic term used for actuators, materials or devices that mimic natural muscle and can reversibly contract, expand, or rotate within one component due to an external stimulus (such as voltage, current, pressure or temperature).[1] [2]The three basic actuation responses - contraction, expansion, and rotation - can be combined together within a single component to produce other types of motions (e.g. bending, by contracting one side of the material while expanding the other side). Conventional motors and pneumatic linear or rotary actuators do not qualify as artificial muscles, because there is more than one component involved in the actuation.'+'<br><br>'+'Due to their high flexibility, versatility and power-to-weight ratio compared with traditional rigid actuators, artificial muscles have the potential to be a highly disruptive emerging technology. Though currently in limited use, the technology may have wide future applications in industry, medicine, robotics and many other fields.',
		links: "https://en.wikipedia.org/wiki/Artificial_muscle"
	},
	{
		title: "Manual override",
		summary: "A manual override (MO) or manual analog override (MAO) is a mechanism wherein control is taken from an automated system and given to the user. For example, a manual override in photography refers to the ability for the human photographer to turn off the automatic aperture sizing, automatic focusing, or any other automated system on the camera."+'<br><br>'+"Some manual overrides can be used to veto an automated system's judgment when the system is in error. An example of this is a printer's ink level detection: in one case, a researcher found that when he overrode the system, up to 38% more pages could be printed at good quality by the printer than the automated system would have allowed."+'<br><br>'+'Automated systems are becoming increasingly common and integrated into everyday objects such as automobiles and domestic appliances. This development of ubiquitous computing raises general issues of policy and law about the need for manual overrides for matters of great importance such as life-threatening situations and major economic decisions. The loyalty of such autonomous devices then becomes an issue. If they follow rules installed by the manufacturer or required by law and refuse to cede control in some situations then the owners of the devices may feel disempowered, alienated and lacking true ownership.',
		links: "https://en.wikipedia.org/wiki/Manual_override"
	},
	{
		title: "Self-driving car",
		summary: 'A self-driving car, also known as a robot car, autonomous car, or driverless car,[1][2] is a vehicle that is capable of sensing its environment and moving with little or no human input.'+'<br><br>'+'Autonomous cars combine a variety of sensors to perceive their surroundings, such as radar, Lidar, sonar, GPS, odometry and inertial measurement units. Advanced control systems interpret sensory information to identify appropriate navigation paths, as well as obstacles and relevant signage.',
		links: "https://en.wikipedia.org/wiki/Self-driving_car"
	},
	{
		title: "Pneumatic motor",
		summary: "A pneumatic motor (air motor) or compressed air engine is a type of motor which does mechanical work by expanding compressed air. Pneumatic motors generally convert the compressed air energy to mechanical work through either linear or rotary motion. Linear motion can come from either a diaphragm or piston actuator, while rotary motion is supplied by either a vane type air motor, piston air motor, air turbine or gear type motor."
		+'<br><br>'+
		"Pneumatic motors have existed in many forms over the past two centuries, ranging in size from hand-held motors to engines of up to several hundred horsepower. Some types rely on pistons and cylinders; others on slotted rotors with vanes (vane motors) and others use turbines. Many compressed air engines improve their performance by heating the incoming air or the engine itself. Pneumatic motors have found widespread success in the hand-held tool industry,[1] but are also used stationary in a wide range of industrial applications. Continual attempts are being made to expand their use to the transportation industry. However, pneumatic motors must overcome inefficiencies before being seen as a viable option in the transportation industry.",
		links: "https://en.wikipedia.org/wiki/Pneumatic_motor"
	},
	{
		title: "Mix automation",
		summary: "Modern digital audio consoles or mixers use automation. Automation allows the console to remember the audio engineer's adjustment of faders during the post-production editing process. A timecode is necessary for synchronization of automation.",
		links: "https://en.wikipedia.org/wiki/Mix_automation"
	},
	{
		title: "Open Platform Communications",
		summary: "Open Platform Communications (OPC) is a series of standards and specifications for industrial telecommunication. An industrial automation task force developed the original standard in 1996 under the name OLE for Process Control (Object Linking and Embedding for process control). OPC specifies the communication of real-time plant data between control devices from different manufacturers."
		+'<br><br>'+
		"After the initial release in 1996, the OPC Foundation was created to maintain the standard.[1] As OPC has been adopted beyond the field of process control, the OPC Foundation changed the name to Open Platform Communications in 2011.[2] The change in name reflects the applications of OPC technology for applications in building automation, discrete manufacturing, process control and many others. OPC has also grown beyond its original OLE (Object Linking and Embedding) implementation to include other data transportation technologies including Microsoft's .NET Framework, XML, and even the OPC Foundation's binary-encoded TCP format.",
		links: "https://en.wikipedia.org/wiki/Open_Platform_Communications"
	},
	{
		title: "Electronic control unit",
		summary: "An Electronic Control Unit (ECU) is any embedded system in automotive electronics that controls one or more of the electrical systems or subsystems in a vehicle."
		+'<br><br>'+
		"Types of ECU include Engine Control Module (ECM), Powertrain Control Module (PCM), Transmission Control Module (TCM), Brake Control Module (BCM or EBCM), Central Control Module (CCM), Central Timing Module (CTM), General Electronic Module (GEM), Body Control Module (BCM), Suspension Control Module (SCM), control unit, or control module. Taken together, these systems are sometimes referred to as the car's computer (Technically there is no single computer but multiple ones.) Sometimes one assembly incorporates several of the individual control modules (PCM is often both engine and transmission)."
		+'<br><br>'+
		"Some modern motor vehicles have up to 80 ECUs. Embedded software in ECUs continues to increase in line count, complexity, and sophistication.[2] Managing the increasing complexity and number of ECUs in a vehicle has become a key challenge for original equipment manufacturers (OEMs).",
		links: "https://en.wikipedia.org/wiki/Electronic_control_unit"
	}
]

index = Math.floor(Math.random() * myData.length);

var article = myData[index];

document.getElementById("article-title").innerHTML = article.title;
document.getElementById("article-summary").innerHTML = article.summary;
document.getElementById("article-link").href = article.links;