var myData = [
	{
		title: "Bioactive terrarium",
		summary: 'A bioactive terrarium (or vivarium) is a terrarium for housing one or more terrestrial animals which also includes populations of small invertebrates and microorganisms to consume and break down the waste products of the primary species. This population of decomposers is colloquially referred to as the "cleanup crew" (abbr. "CUC"), and can include terrestrial isopods, springtails, earthworms, millipedes, and various beetles as determined by compatibility with the habitat of the primary species (e.g. tropical rainforest vs. desert). In a fully functional bioactive terrarium, all of the waste products will be broken down by the cleanup crew, eliminating the need for cage cleaning and preventing odors. While most bioactive terrariums are also naturalistic (with live plants, soil, lighting, and naturalistic decor), a terrarium may be bioactive without being naturalistic, and naturalistic without being bioactive).',
		links: "https://en.wikipedia.org/wiki/Bioactive_terrarium"
	},
	{
		title: "Pseudohypoxia",
		summary: "Pseudohypoxia refers to increased cytosolic ratio of free NAD to NADH in cells, caused by hyperglycemia.[1] Research has shown that declining levels of NAD+ during aging cause pseudohypoxia, and that raising nuclear NAD+ in old mice reverses pseudohypoxia and metabolic dysfunction, thus reversing the aging process.[2] It is expected that human NAD trials will begin in 2014."+'<br><br>'+'Pseudohypoxia is a feature commonly noted in poorly-controlled diabetes.',
		links: "https://en.wikipedia.org/wiki/Pseudohypoxia"
	},
	{
		title: "Charles Darwin",
		summary: 'Charles Robert Darwin, FRS FRGS FLS FZS[2] (/ˈdɑːrwɪn/;[5] 12 February 1809 – 19 April 1882) was an English naturalist, geologist and biologist,[6] best known for his contributions to the science of evolution.[I] His proposition that all species of life have descended over time from common ancestors is now widely accepted, and considered a foundational concept in science.[7] In a joint publication with Alfred Russel Wallace, he introduced his scientific theory that this branching pattern of evolution resulted from a process that he called natural selection, in which the struggle for existence has a similar effect to the artificial selection involved in selective breeding.'+'<br><br>'+"Darwin published his theory of evolution with compelling evidence in his 1859 book On the Origin of Species, overcoming scientific rejection of earlier concepts of transmutation of species.[9][10] By the 1870s, the scientific community and a majority of the educated public had accepted evolution as a fact. However, many favoured competing explanations, and it was not until the emergence of the modern evolutionary synthesis from the 1930s to the 1950s that a broad consensus developed in which natural selection was the basic mechanism of evolution.[11][12] Darwin's scientific discovery is the unifying theory of the life sciences, explaining the diversity of life."+'<br><br>'+"Darwin's early interest in nature led him to neglect his medical education at the University of Edinburgh; instead, he helped to investigate marine invertebrates. Studies at the University of Cambridge (Christ's College) encouraged his passion for natural science.[15] His five-year voyage on HMS Beagle established him as an eminent geologist whose observations and theories supported Charles Lyell's uniformitarian ideas, and publication of his journal of the voyage made him famous as a popular author."+'<br><br>'+"Puzzled by the geographical distribution of wildlife and fossils he collected on the voyage, Darwin began detailed investigations, and in 1838 conceived his theory of natural selection.[17] Although he discussed his ideas with several naturalists, he needed time for extensive research and his geological work had priority.[18] He was writing up his theory in 1858 when Alfred Russel Wallace sent him an essay that described the same idea, prompting immediate joint publication of both of their theories.[19] Darwin's work established evolutionary descent with modification as the dominant scientific explanation of diversification in nature.[11] In 1871 he examined human evolution and sexual selection in The Descent of Man, and Selection in Relation to Sex, followed by The Expression of the Emotions in Man and Animals (1872). His research on plants was published in a series of books, and in his final book, The Formation of Vegetable Mould, through the Actions of Worms (1881), he examined earthworms and their effect on soil."+'<br><br>'+"Darwin has been described as one of the most influential figures in human history,[22] and he was honoured by burial in Westminster Abbey."+'<br><br>'+"Since 2008, a statue of Charles Darwin occupies the place of honour at London's Natural History Museum.",
		links: "https://en.wikipedia.org/wiki/Charles_Darwin"
	},
	{
		title: "Sociobiology",
		summary: "Sociobiology is a field of biology that aims to examine and explain social behavior in terms of evolution. It draws from disciplines including ethology, anthropology, evolution, zoology, archaeology, and population genetics. Within the study of human societies, sociobiology is closely allied to Darwinian anthropology, human behavioral ecology and evolutionary psychology."
		+'<br><br>'+
		"Sociobiology investigates social behaviors such as mating patterns, territorial fights, pack hunter pack hunting, and the hive society of social insects. It argues that just as selection pressure led to animals evolving useful ways of interacting with the natural environment, so also it led to the genetic evolution of advantageous social behavior."
		+'<br><br>'+
		"While the term 'sociobiology' originated at least as early as the 1940s, the concept did not gain major recognition until the publication of E. O. Wilson's book Sociobiology: The New Synthesis in 1975. The new field quickly became the subject of controversy. Critics, led by Richard Lewontin and Stephen Jay Gould, argued that genes played a role in human behavior, but that traits such as aggressiveness could be explained by social environment rather than by biology. Sociobiologists responded by pointing to the complex relationship between nature and nurture.",
		links: "https://en.wikipedia.org/wiki/Sociobiology"
	},
	{
		title: "Trabecular cartilage",
		summary: "Trabecular cartilages (trabeculae cranii, sometimes simply trabeculae, prechordal cartilages) are paired, rod-shaped cartilages, which develop in the head of the vertebrate embryo. They are the primordia of the anterior part of the cranial base, and are derived from the cranial neural crest cells.",
		links: "https://en.wikipedia.org/wiki/Trabecular_cartilage"
	},
	{
		title: "Nuclear calcium",
		summary: "The concentration of calcium in the cell nucleus can increase in response to signals from the environment. Nuclear calcium is an evolutionary conserved potent regulator of gene expression that allows cells to undergo long-lasting adaptive responses. The 'Nuclear Calcium Hypothesis’ by Hilmar Bading describes nuclear calcium in neurons as an important signaling end-point in synapse-to-nucleus communication that activates gene expression programs needed for persistent adaptations.[1] In the nervous system, nuclear calcium is required for long-term memory formation, acquired neuroprotection, and the development of chronic inflammatory pain.[2][3][4][5] In the heart, nuclear calcium is important for the development of cardiac hypertrophy.[6][7] In the immune system, nuclear calcium is required for human T cell activation.[8] Plants use nuclear calcium to control symbiosis signaling.",
		links: "https://en.wikipedia.org/wiki/Nuclear_calcium"
	},
	{
		title: "Archinephros",
		summary: "The archinephros is a primitive kidney that has been retained by the larvae of hagfish and some caecilians. It also occurs in the embryos of higher animals as the simplest kind of excretory organ. The archinephros is nonfunctional in humans and other mammals."
		+'<br><br>'+
		"The three types of mature vertebrate kidneys develop from the archinephros: the pronephros from the front section, the mesonephros from the mid-section and the metanephros from the rear section.",
		links: "https://en.wikipedia.org/wiki/Archinephros"
	}
]

index = Math.floor(Math.random() * myData.length);

var article = myData[index];

document.getElementById("article-title").innerHTML = article.title;
document.getElementById("article-summary").innerHTML = article.summary;
document.getElementById("article-link").href = article.links;