var myData = [
	{
		title: "Speleology",
		summary: "Speleology is the scientific study of caves and other karst features, as well as their make-up, structure, physical properties, history, life forms, and the processes by which they form (speleogenesis) and change over time (speleomorphology). The term speleology is also sometimes applied to the recreational activity of exploring caves, but this is more properly known as caving or potholing, or (not usually by participants) by the uncommon American term spelunking. Speleology and caving are often connected, as the physical skills required for in situ study are the same."+'<br><br>'+"Speleology is a cross-disciplinary field that combines the knowledge of chemistry, biology, geology, physics, meteorology, and cartography to develop portraits of caves as complex, evolving systems.",
		links: "https://en.wikipedia.org/wiki/Speleology"
	},
	{
		title: "Cascades Volcano Observatory",
		summary: "The David A. Johnston Cascades Volcano Observatory (CVO) is a volcano observatory that monitors volcanoes in the northern Cascade Range. It was established in the summer of 1980, after the eruption of Mount St. Helens.[1] The observatory is named for United States Geological Survey (USGS) volcanologist David A. Johnston, who was swept away in the Mount St. Helens eruption on the morning of May 18, 1980.[2] The observatory's current territory covers Oregon, Washington, and Idaho. The Cascade Range's extent includes northern California, and Cascade volcanoes in that state, such as Mount Shasta and Lassen Peak, previously fell under the CVO's jurisdiction. However, these volcanoes now fall under the jurisdiction of the California Volcano Observatory (CalVO), formed in February 2012 and based in Menlo Park, California, which monitors and researches volcanic activity throughout California and Nevada."+'<br><br>'+"The Cascades Volcano Observatory is part of the USGS, a scientific agency of the United States government.[4] It is located in Vancouver, Washington in the Portland, Oregon metropolitan area.",
		links: "https://en.wikipedia.org/wiki/Cascades_Volcano_Observatory"
	},
	{
		title: "Weather and climate",
		summary: 'There is often confusion between weather and climate. Weather is the condition of the atmosphere at a particular place over a short period of time, whereas climate refers to the weather pattern, using statistical data, of a place over a long enough period to yield meaningful averages.'+'<br><br>'+"Climatology studies climate, meteorology is the study of weather; both are atmospheric sciences. Climate is an important physical element because it indicates the atmospheric condition of heat, moisture and circulation; it plays a dominant role in shaping vegetation and soil; and it ultimately affects all forms of life, as a result of the very definition of the word, which is a scientific prediction, based on evidentiary statistics, sustained over a long period.",
		links: "https://en.wikipedia.org/wiki/Weather_and_climate"
	},
	{	title: "Geophysics",
		summary: "Geophysics /dʒiːoʊfɪzɪks/ is a subject of natural science concerned with the physical processes and physical properties of the Earth and its surrounding space environment, and the use of quantitative methods for their analysis. The term geophysics sometimes refers only to the geological applications: Earth's shape; its gravitational and magnetic fields; its internal structure and composition; its dynamics and their surface expression in plate tectonics, the generation of magmas, volcanism and rock formation.[3] However, modern geophysics organizations use a broader definition that includes the water cycle including snow and ice; fluid dynamics of the oceans and the atmosphere; electricity and magnetism in the ionosphere and magnetosphere and solar-terrestrial relations; and analogous problems associated with the Moon and other planets."
		+'<br><br>'+
		"Although geophysics was only recognized as a separate discipline in the 19th century, its origins date back to ancient times. The first magnetic compasses were made from lodestones, while more modern magnetic compasses played an important role in the history of navigation. The first seismic instrument was built in 132 AD. Isaac Newton applied his theory of mechanics to the tides and the precession of the equinox; and instruments were developed to measure the Earth's shape, density and gravity field, as well as the components of the water cycle. In the 20th century, geophysical methods were developed for remote exploration of the solid Earth and the ocean, and geophysics played an essential role in the development of the theory of plate tectonics."
		+'<br><br>'+
		"Geophysics is applied to societal needs, such as mineral resources, mitigation of natural hazards and environmental protection.[4] In Exploration Geophysics, Geophysical survey data are used to analyze potential petroleum reservoirs and mineral deposits, locate groundwater, find archaeological relics, determine the thickness of glaciers and soils, and assess sites for environmental remediation.",
		links: "https://en.wikipedia.org/wiki/Geophysics"
	},
	{	title: "Fluvioglacial landform",
		summary: "Fluvioglacial landforms are landforms molded by glacial meltwater. This discharge of glacial streams, both over the surface (supraglacial) and beneath the ice sheet (subglacial), is higher in the warmer summer months. As subglacial water often flows under pressure, it has a high velocity and is very turbulent. This high velocity enables it to transport a large amount of material which would not normally be transported in a regular stream of similar size; boulders thus transported may remain as glacial erratics in the post-glacial terrain. As this material is transported it makes contact with the underside of a glacier and erodes vertically from below by abrasion. This erosion creates subglacial valleys. When there is a decrease in discharge of the glacial steams, deposition occurs, and is responsible for large groupings of landforms like eskers and drumlins in glaciated areas."
		+'<br><br>'+
		'Pro-glacial lakes leave their own passive impress on the glaciated landscape, recognizable by the flatness of the former lakebed and raised terraces that mark former shorelines.'
		+'<br><br>'+
		"More active massive scouring occurs when ice dams of pro-glacial lakes fail catastrophically in a glacial lake outburst flood; the results can be seen, for example in the Channeled Scablands in the U.S. state of Washington, created by the cataclysmic Missoula Floods that swept periodically across eastern Washington and down the Columbia River Plateau during the Pleistocene epoch. The Shonkin Sag along the northern edge of the Highwood Mountains, Montana, is a channel formed by the Missouri River and glacial meltwater pouring from Glacial Lake Great Falls; it is one of the most famous prehistoric meltwater channels in the world.",
		links: "https://en.wikipedia.org/wiki/Fluvioglacial_landform"
	},
	{	title: "Volcanology",
		summary: "Volcanology (also spelled vulcanology) is the study of volcanoes, lava, magma, and related geological, geophysical and geochemical phenomena (volcanism). The term volcanology is derived from the Latin word vulcan. Vulcan was the ancient Roman god of fire."
		+'<br><br>'+
		'A volcanologist is a geologist who studies the eruptive activity and formation of volcanoes, and their current and historic eruptions. Volcanologists frequently visit volcanoes, especially active ones, to observe volcanic eruptions, collect eruptive products including tephra (such as ash or pumice), rock and lava samples. One major focus of enquiry is the prediction of eruptions; there is currently no accurate way to do this, but predicting eruptions, like predicting earthquakes, could save many lives.',
		links: "https://en.wikipedia.org/wiki/Volcanology"
	},
	{	title: "Sedimentation",
		summary: "Sedimentation is the tendency for particles in suspension to settle out of the fluid in which they are entrained and come to rest against a barrier. This is due to their motion through the fluid in response to the forces acting on them: these forces can be due to gravity, centrifugal acceleration, or electromagnetism. In geology, sedimentation is often used as the opposite of erosion, i.e., the terminal end of sediment transport. In that sense, it includes the termination of transport by saltation or true bedload transport. Settling is the falling of suspended particles through the liquid, whereas sedimentation is the termination of the settling process. In estuarine environments, settling can be influenced by the presence or absence of vegetation. Trees such as mangroves are crucial to the attenuation of waves or currents, promoting the settlement of suspended particles."
		+'<br><br>'+
		'Sedimentation may pertain to objects of various sizes, ranging from large rocks in flowing water to suspensions of dust and pollen particles to cellular suspensions to solutions of single molecules such as proteins and peptides. Even small molecules supply a sufficiently strong force to produce significant sedimentation.'
		+'<br><br>'+
		"The term is typically used in geology to describe the deposition of sediment which results in the formation of sedimentary rock, but it is also used in various chemical and environmental fields to describe the motion of often-smaller particles and molecules. This process is also used in the biotech industry to separate cells from the culture media.",
		links: "https://en.wikipedia.org/wiki/Sedimentation"
	}
]

index = Math.floor(Math.random() * myData.length);

var article = myData[index];

document.getElementById("article-title").innerHTML = article.title;
document.getElementById("article-summary").innerHTML = article.summary;
document.getElementById("article-link").href = article.links;