var myData = [
	{
		title: "Acousto-electronics",
		summary: "Acousto-electronics (also spelled 'Acoustoelectronics') is a branch of physics, acoustics and electronics that studies interactions of ultrasonic and hypersonic waves in solids with electrons and with electro-magnetic fields. Typical phenomena studied in acousto-electronics are acousto-electric effect and also amplification of acoustic waves by flows of electrons in piezoelectric semiconductors, when the drift velocity of the electrons exceeds the velocity of sound. The term 'acousto-electronics' is often understood in a wider sense to include numerous practical applications of the interactions of electro-magnetic fields with acoustic waves in solids. In particular, these are signal processing devices using surface acoustic waves (SAW), different sensors of temperature, pressure, humidity, acceleration, etc.",
		links: "https://en.wikipedia.org/wiki/Acousto-electronics"
	},
	{
		title: "Nuclear electronics",
		summary: "Nuclear electronics is a subfield of electronics concerned with the design and use of high-speed electronic systems for nuclear physics and elementary particle physics research, and for industrial and medical use."+'<br><br>'+"Essential elements of such systems include fast detectors for charged particles, discriminators for separating them by energy, counters for counting the pulses produced by individual particles, fast logic circuits (including coincidence and veto gates), for identification of particular types of complex particle events, and pulse height analyzers (PHAs) for sorting and counting gamma rays or particle interactions by energy, for spectral analysis.",
		links: "https://en.wikipedia.org/wiki/Nuclear_electronics"
	},
	{
		title: "Hydraulic analogy",
		summary: 'The electronic-hydraulic analogy (derisively referred to as the drain-pipe theory by Oliver Lodge) [1] is the most widely used analogy for "electron fluid" in a metal conductor. Since electric current is invisible and the processes at play in electronics are often difficult to demonstrate, the various electronic components are represented by hydraulic equivalents. Electricity (as well as heat) was originally understood to be a kind of fluid, and the names of certain electric quantities (such as current) are derived from hydraulic equivalents. As with all analogies, it demands an intuitive and competent understanding of the baseline paradigms (electronics and hydraulics).',
		links: "https://en.wikipedia.org/wiki/Hydraulic_analogy"
	},
	{	title: "Atomtronics",
		summary: "Atomtronics is an emerging sub-field of ultracold atomic physics which encompasses a broad range of topics featuring guided atomic matter waves. The systems typically include components analogous to those found in electronic or optical systems, such as beam splitters and transistors. Applications range from studies of fundamental physics to the development of practical devices.",
		links: "https://en.wikipedia.org/wiki/Atomtronics"
	},
	{	title: "Solid-state electronics",
		summary: "Solid-state electronics means semiconductor electronics; electronic equipment using semiconductor devices such as semiconductor diodes, transistors, and integrated circuits (ICs).[1][2][3][4][5] The term is also used for devices in which semiconductor electronics which have no moving parts replace devices with moving parts, such as the solid-state relay in which transistor switches are used in place of a moving-arm electromechanical relay, or the solid-state drive (SSD) a type of semiconductor memory used in computers to replace hard disk drives, which store data on a rotating disk."
		+'<br><br>'+
		"The term 'solid state' became popular in the beginning of the semiconductor era in the 1960s to distinguish this new technology based on the transistor, in which the electronic action of devices occurred in a solid state, from previous electronic equipment that used vacuum tubes, in which the electronic action occurred in a gaseous state. A semiconductor device works by controlling an electric current consisting of electrons or holes moving within a solid crystalline piece of semiconducting material such as silicon, while the thermionic vacuum tubes it replaced worked by controlling current conducted by a gas of particles, electrons or ions, moving in a vacuum within a sealed tube. Although the first solid state electronic device was the cat's whisker detector, a crude semiconductor diode invented around 1904, solid state electronics really started with the invention of the transistor in 1947.[7] Before that, all electronic equipment used vacuum tubes, because vacuum tubes were the only electronic components that could amplify, an essential capability in all electronics. The replacement of bulky, fragile, energy-wasting vacuum tubes by transistors in the 1960s and 1970s created a revolution not just in technology but in people's habits, making possible the first truly portable consumer electronics such as the transistor radio, cassette tape player, walkie-talkie and quartz watch, as well as the first practical computers and mobile phones."
		+'<br><br>'+
		"Today, almost all electronics are solid-state except in some applications such as radio transmitters, in which vacuum tubes are still used, and some power industrial control circuits which use electromechanical devices such as relays. Additional examples of solid state electronic devices are the microprocessor chip, LED lamp, solar cell, charge coupled device (CCD) image sensor used in cameras, and semiconductor laser.",
		links: "https://en.wikipedia.org/wiki/Solid-state_electronics"
	},
	{	title: "Microelectronics",
		summary: "Microelectronics is a subfield of electronics. As the name suggests, microelectronics relates to the study and manufacture (or microfabrication) of very small electronic designs and components. Usually, but not always, this means micrometre-scale or smaller. These devices are typically made from semiconductor materials. Many components of normal electronic design are available in a microelectronic equivalent. These include transistors, capacitors, inductors, resistors, diodes and (naturally) insulators and conductors can all be found in microelectronic devices. Unique wiring techniques such as wire bonding are also often used in microelectronics because of the unusually small size of the components, leads and pads. This technique requires specialized equipment and is expensive."
		+'<br><br>'+
		"Digital integrated circuits (ICs) consist mostly of transistors[why?]. Analog circuits commonly contain resistors and capacitors as well. Inductors are used in some high frequency analog circuits, but tend to occupy larger chip area due to their lower reactance at low frequencies. Gyrators can replace them in many applications."
		+'<br><br>'+
		"As techniques have improved, the scale of microelectronic components has continued to decrease[citation needed]. At smaller scales, the relative impact of intrinsic circuit properties such as interconnections may become more significant. These are called parasitic effects, and the goal of the microelectronics design engineer is to find ways to compensate for or to minimize these effects, while delivering smaller, faster, and cheaper devices."
		+'<br><br>'+
		"Today, microelectronics design is largely aided by Electronic Design Automation software.",
		links: "https://en.wikipedia.org/wiki/Microelectronics"
	},
	{	title: "Macroelectronics",
		summary: "For over half of century, the technology of microelectronics has been advancing by miniaturization, leading to significant increases in computing power and continuous decreases in manufacturing cost. In parallel, remarkable progress on enlarging system scale in recent years gives rise to a nascent field known as macroelectronics, in which microelectronic devices are distributed yet integrated over large area substrates with sizes much bigger than semiconductor wafers."
		+'<br><br>'+
		"Currently, the macroelectronics industry is dramatically growing in the similar way as the microelectronics was in early ’90s. The most visible example of macroelectronics at present is flat-panel displays, which have been rapidly replacing cathode-ray tubes as the monitors of choice for computers and televisions since 2000. The flat-panel displays have enabled applications unimaginable for cathode-ray tubes. For example, the Dolphins Stadium in Miami will soon have the world's largest high definition video display, about 15 m high and 42 m wide, comprising more than 4.6 million light-emitting diodes, showing image of more than 1.5 million pixels."
		+'<br><br>'+
		"While the commercial success of flat-panel display opens an era of large area electronics, other emerging applications, such as rollable display, printable thin film solar cell and electronic skin, demonstrate further desirable attributes for macroelectronic systems, including flexibility, portability and low-cost. To realize these attributes, a growing trend is to fabricate macroelectronic products directly on flexible substrates, such as polymers. The flat-panel displays currently available in market are fabricated on glass substrates and are fragile. A case in recent news is the cracking of the screens of the iPod nano, a music player that Apple Computer expects to be its best-selling portable device. By contrast, displays made on thin polymer substrates are rugged. Flexible displays of large areas will be lightweight and can be rolled up – they will be portable. For example, in Sept. 2005, Philips Polymer Vision has revealed the world's first prototype of a rollable electronic reader, which can unfold to a 5-inch display and roll back into a pocket-size (100×60×20 mm) device. Furthermore, such thin-film devices on flexible polymer substrates can lend themselves to low-cost fabrication process (i.e., roll-to-roll printing), resulting in lightweight, rugged and flexible macroelectronic products.",
		links: "https://en.wikipedia.org/wiki/Macroelectronics"
	}
]

index = Math.floor(Math.random() * myData.length);

var article = myData[index];

document.getElementById("article-title").innerHTML = article.title;
document.getElementById("article-summary").innerHTML = article.summary;
document.getElementById("article-link").href = article.links;