var myData = [
	{
		title: "Audition",
		summary: "An audition is a sample performance by an actor, singer, musician, dancer or other performer. It typically involves the performer displaying their talent through a previously memorized and rehearsed solo piece or by performing a work or piece given to the performer at the audition or shortly before. In some cases, such as with a model or acrobat, the individual may be asked to demonstrate a range of professional skills. Actors may be asked to present a monologue. Singers will perform a song in a popular music context or an aria in a Classical context. A dancer will present a routine in a specific style, such as ballet, tap dance or hip-hop, or show his or her ability to quickly learn a choreographed dance piece."+'<br><br>'+'The audition is a systematic process in which industry professionals select performers, which is in some ways analogous to a job interview in the regular job market. In an audition, the employer is testing the ability of the applicant to meet the needs of the job and assess how well the individual will take directions and deal with changes. After some auditions, after the performer has demonstrated their abilities in a given performance style, the audition panel may ask a few questions that resemble those used in standard job interviews (e.g., regarding availability).'+'<br><br>'+"Auditions are required for many reasons in the performing arts world. Often, employing companies or groups use auditions to select performers for upcoming shows or productions. An audition for a performing opportunity may be for a single performance (e.g., doing a monologue at a comedy club), for a series or season of performances (a season of a Broadway play), or for permanent employment with the performing organization (e.g., an orchestra or dance troupe). Auditions for performing opportunities may be for amateur, school, or community organizations, in which case the performers will typically not be paid. As well, auditions are used to select or screen candidates for entry to training programs (ballet school or circus school); university programs (B.Mus, M.Mus, MFA in Theater); performance-related scholarships and grants; or to be considered for representation by a talent agency or individual agent.",
		links: "https://en.wikipedia.org/wiki/Audition"
	},
	{
		title: "Home cinema",
		summary: "Home cinema, also called a home theater, a home theatre, and a theater room, are home entertainment audio-visual systems that seek to reproduce a movie theater experience and mood using consumer electronics-grade video and audio equipment that is set up in a room or backyard of a private home. In the 1980s, home cinemas typically consisted of a movie pre-recorded on a LaserDisc or VHS tape; a LaserDisc or VHS player; and a heavy, bulky large-screen cathode ray tube TV set. In the 2000s, technological innovations in sound systems, video player equipment and TV screens and video projectors have changed the equipment used in home theatre set-ups and enabled home users to experience a higher-resolution screen image, improved sound quality and components that offer users more options (e.g., many of the more expensive Blu-ray players in 2016 can also "stream" movies and TV shows over the Internet using subscription services such as Netflix). The development of Internet-based subscription services means that 2016-era home theatre users do not have to commute to a video rental store as was common in the 1980s and 1990s (nevertheless, some movie enthusiasts buy DVD or Blu-ray discs of their favourite content)."+'<br><br>'+'Today, a home cinema system typically uses a large projected image from a video projector or a large flat-screen high-resolution HDTV system, a movie or other video content on a DVD or high-resolution Blu-ray disc, which is played on a DVD player or Blu-ray player, with the audio augmented with a multi-channel power amplifier and anywhere from two speakers and a stereo power amp (for stereo sound) to a 5.1 channel amplifier and five or more surround sound speaker cabinets (with a surround sound system). Whether home cinema enthusiasts have a stereo set-up or a 5.1 channel surround system, they typically use at least one low-frequency subwoofer speaker cabinet to amplify low-frequency effects from movie soundtracks and reproduce the deep pitches from the musical soundtrack.',
		links: "https://en.wikipedia.org/wiki/Home_cinema"
	},
	{
		title: "Transgressive art",
		summary: "Transgressive art is art that aims to transgress; i.e. to outrage or violate basic morals and sensibilities. The term transgressive was first used in this sense by American filmmaker Nick Zedd and his Cinema of Transgression in 1985. [1] Zedd used it to describe his legacy with underground film-makers like Paul Morrissey, John Waters, and Kenneth Anger, and the relationship they shared with Zedd and his New York City peers in the early 1980s.",
		links: "https://en.wikipedia.org/wiki/Transgressive_art"
	}
]

index = Math.floor(Math.random() * myData.length);

var article = myData[index];

document.getElementById("article-title").innerHTML = article.title;
document.getElementById("article-summary").innerHTML = article.summary;
document.getElementById("article-link").href = article.links;