var myData = [
	{
		title: "Plant expressed vaccine",
		summary: "Plant expressed vaccine or project GreenVax[1] In 2005 DARPA’s Accelerated Manufacture of Pharmaceuticals (AMP) program was created In response to emerging and novel biologic threats.[2] In 2009 DARPA offered a government contract for a Non-GMO plant-based systems expressing recombinant proteins, due to The 2009 H1N1 swine flu pandemic that highlighted the national need for rapid and agile vaccine manufacturing capabilities.[3] The Texas A&M University and a Texas company have been awarded a $40 million U.S. Department of Defense grant to develop a plant expressed vaccine made from tobacco.[4] While egg-based vaccines typically take more than six months to develop after a virus is isolated, the new process will take only four to six weeks.[4] The vice chancellor for research at A&M System declared that if the project works it will be one of the largest and most capable vaccine facilities in the world.[4] However the major problem is the public acceptance of this technology, many of the companies are looking for the FDA approval "+'<br><br>'+'The plant-based vaccine production method works by isolating a specific antigen protein, one that triggers a human immune response from the targeted virus. A gene from the protein is transferred to bacteria, which are then used to “infect” plant cells. The plants then start producing the exact protein that will be used for vaccinations.[6] Other uses of plant-expressed vaccines including the successful creation of edible bananas that protect against the Norwalk virus.',
		links: "https://en.wikipedia.org/wiki/Plant_expressed_vaccine"
	},
	{
		title: "Olive oil extraction",
		summary: 'Olive oil extraction is the process of extracting the oil present in olive drupes, known as olive oil. Olive oil is produced in the mesocarp cells, and stored in a particular type of vacuole called a lipo vacuole, i.e., every cell contains a tiny olive oil droplet. Olive oil extraction is the process of separating the oil from the other fruit contents (vegetative extract liquid and solid material). It is possible to attain this separation by physical means alone, i.e., oil and water do not mix, so they are relatively easy to separate. This contrasts with other oils that are extracted with chemical solvents, generally hexane.[1] The first operation when extracting olive oil is washing the olives, to reduce the presence of contaminants, especially soil which can create a particular flavor effect called "soil taste".',
		links: "https://en.wikipedia.org/wiki/Olive_oil_extraction"
	},
	{
		title: "Stuffed and Starved",
		summary: 'Stuffed and Starved: The Hidden Battle for the World Food System is a non-fiction book written by Raj Patel. It was published in 2008 by Melville House Publishing. Stuffed and Starved looks at the inequities of the world food system from the beginning to the end of the conventional food chain, from producers to manufacturers and distributors to consumers.'+'<br><br>'+'According to Naomi Klein, Stuffed and Starved is "One of the most dazzling books I have read in a very long time. The product of a brilliant mind, and a gift to a world hungering for justice."',
		links: "https://en.wikipedia.org/wiki/Stuffed_and_Starved"
	},
	{	title: "Biomanufacturing",
		summary: "Biomanufacturing is a type of manufacturing or biotechnology that utilizes biological systems to produce commercially important biomaterials and biomolecules for use in medicines, food and beverage processing, and industrial applications. Biomanufacturing products are recovered from natural sources, such as blood, or from cultures of microbes, animal cells, or plant cells grown in specialized equipment. The cells used during the production may have been naturally occurring or derived using genetic engineering techniques.",
		links: "https://en.wikipedia.org/wiki/Biomanufacturing"
	},
	{	title: "Food prices",
		summary: "Food prices refer to the (averaged) price level for food in particular countries or regions or on a global scale. The food industry's contribution to the price levels and fluctuations come from the food production process, food marketing and food distribution. Source of uncontrollable price fluctuations are varying crop yield from excess supply to harvest failure and food speculation activities. It is speculated that already the global climate change could be a major factor behind rising food prices.[1] A continuing drought in South Africa[2] may - amongst other factors - have food inflation soar 11% until end of 2016 according to the South African Reserve Bank.[3] To a certain extent, adverse price trends can be counteracted by food politics. When food commodities become too expensive on the world market, food security is in danger especially for developing countries. In keeping with the supply and demand-principle, global prices will on average continue to rise with the growing world population.",
		links: "https://en.wikipedia.org/wiki/Food_prices"
	},
	{	title: "Open Food Facts",
		summary: "Open Food Facts is a free, online and crowdsourced database of food products from around the world[1] licensed under the Open Database License (ODBL)[2] while its artwork —uploaded by contributors— is distributed under a Creative Commons Attribution–Share Alike license."
		+'<br><br>'+
		"The project was launched on 19 May 2012 by French programmer Stéphane Gigandet[4] during the Food Revolution Day organized by Jamie Oliver[5] and has won the 2013 Dataconnexions Award from Etalab[6] and the 2015 OKFN Award from Open Knowledge"
		+'<br><br>'+
		"In May 2016, its database contained more than 80,000 products from 141 countries.[8] In June 2017, thanks to the growing ecosystem of apps and open data imports from various countries, this number rose to 880,000.",
		links: "https://en.wikipedia.org/wiki/Open_Food_Facts"
	},
	{	title: "Agricultural marketing",
		summary: "Agricultural marketing is inferred to cover the services involved in moving an agricultural product from the farm to the consumer. It is also the planning, organizing, directing and handling of agricultural produce in such a way as to satisfy the farmer, producer and the consumer. Numerous interconnected activities are involved in doing this, such as planning production, growing and harvesting, grading, packing and packaging, transport, storage, agro- and food processing, distribution, advertising and sale. Effectively, the term encompasses the entire range of supply chain operations. However, its key function is to help direct these services, by providing competent and able market information, thereby linking the other operations into an integrated service with targeted outcomes.",
		links: "https://en.wikipedia.org/wiki/Agricultural_marketing"
	}
]

index = Math.floor(Math.random() * myData.length);

var article = myData[index];

document.getElementById("article-title").innerHTML = article.title;
document.getElementById("article-summary").innerHTML = article.summary;
document.getElementById("article-link").href = article.links;