var myData = [
	{
		title: "Analog television",
		summary: "Analog television or analogue television is the original television technology that uses analog signals to transmit video and audio.[1] In an analog television broadcast, the brightness, colors and sound are represented by rapid variations of either the amplitude, frequency or phase of the signal."+'<br><br>'+"Analog signals vary over a continuous range of possible values which means that electronic noise and interference becomes reproduced by the receiver. Thus with analog, a moderately weak signal becomes snowy and subject to interference. In contrast, a moderately weak digital signal and a very strong digital signal transmit equal picture quality. Analog television may be wireless (terrestrial television and satellite television) or can be distributed over a cable network using cable converters (cable television)."+'<br><br>'+'All broadcast television systems used analog signals before the arrival of digital television (DTV). Motivated by the lower bandwidth requirements of compressed digital signals, since the 2000s a digital television transition is proceeding in most countries of the world, with different deadlines for cessation of analog broadcasts.',
		links: "https://en.wikipedia.org/wiki/Analog_television"
	},
	{
		title: "Color television",
		summary: 'Color television is a television transmission technology that includes information on the color of the picture, so the video image can be displayed in color on the television set. It is an improvement on the earliest television technology, monochrome or black and white television, in which the image is displayed in shades of gray (grayscale). Television broadcasting stations and networks in most parts of the world upgraded from black and white to color transmission in the 1970s and 1980s. The invention of color television standards is an important part of the history of television, and it is described in the technology of television article.'+'<br><br>'+"Transmission of color images using mechanical scanners had been conceived as early as the 1880s. A practical demonstration of mechanically-scanned color television was given by John Logie Baird in 1928, but the limitations of a mechanical system were apparent even then. Development of electronic scanning and display made an all-electronic system possible. Early monochrome transmission standards were developed prior to the Second World War, but civilian electronics developments were frozen during much of the war. In August 1944, Baird gave the world's first demonstration of a practical fully electronic color television display. In the United States, commercially competing color standards were developed, finally resulting in the NTSC standard for color that retained compatibility with the prior monochrome system. Although the NTSC color standard was proclaimed in 1953 and limited programming became available, it was not until the early 1970s that color television in North America outsold black and white or monochrome units. Color broadcasting in Europe was not standardized on the PAL and SECAM formats until the 1960s."+'<br><br>'+"Broadcasters began to switch from analog color television technology to digital television around 2006. This changeover is now complete in many countries, but analog television is still the standard elsewhere.",
		links: "https://en.wikipedia.org/wiki/Color_television"
	},
	{
		title: "History of display technology",
		summary: 'Electrically operated display devices have developed from electromechanical systems for display of text, up to all-electronic devices capable of full-motion 3D color graphic displays. Electromagnetic devices, using a solenoid coil to control a visible flag or flap, were the earliest type, and were used for text displays such as stock market prices and arrival/departure display times. The cathode ray tube was the workhorse of text and video display technology for several decades until being displaced by plasma, liquid crystal (LCD) and solid-state devices such as LEDs and OLEDs. With the advent of microprocessors and microelectronic devices, many more individual picture elements ("pixels") could be incorporated into one display device, allowing graphic displays and video.',
		links: "https://en.wikipedia.org/wiki/History_of_display_technology"
	},
	{	title: "Telectroscope",
		summary: "The telectroscope (also referred to as 'electroscope') was the first conceptual model of a television or videophone system. The term was used in the 19th century to describe science-based systems of distant seeing."
		+'<br><br>'+
		'The name and its concept came into being not long after the telephone was patented in 1876, and its original concept evolved from that of remote facsimile reproductions onto paper, into the live viewing of remote images.',
		links: "https://en.wikipedia.org/wiki/Telectroscope"
	},
	{	title: "Channel surfing",
		summary: "Channel surfing (also known as channel hopping or zapping) is the practice of quickly scanning through different television channels or radio frequencies to find something interesting to watch or listen to. Modern viewers, who may have cable or satellite services beaming down dozens if not hundreds or thousands of channels, are frequently channel surfing. It is common for people to scan channels when commercial broadcasters switch from a show over to running commercials."
		+'<br><br>'+
		'The term is most commonly associated with television, where the practice became common with the wide availability of the remote control. The first published use of the term is November 1986, in an article by The Wall Street Journal.'
		+'<br><br>'+
		'The term has some connotations relating to laziness, inattentiveness, and hyperactivity. The behavior itself may also suggest attention deficit hyperactivity disorder (ADHD).'
		+'<br><br>'+
		"Viewers' propensity to channel surf was apparently a factor leading toward the current ATSC standard for terrestrial television, digital television in North America. An ATSC signal can be locked onto and start being decoded within about one second, while it can take several seconds to begin decoding a Digital Video Broadcasting (DVB) signal.",
		links: "https://en.wikipedia.org/wiki/Channel_surfing"
	},
	{	title: "Moon landing",
		summary: "A Moon landing is the arrival of a spacecraft on the surface of the Moon. This includes both manned and unmanned (robotic) missions. The first human-made object to reach the surface of the Moon was the Soviet Union's Luna 2 mission, on 13 September 1959."
		+'<br><br>'+
		"The United States' Apollo 11 was the first manned mission to land on the Moon, on 20 July 1969.[4] There have been six manned U.S. landings (between 1969 and 1972) and numerous unmanned landings, with no soft landings happening from 22 August 1976 until 14 December 2013."
		+'<br><br>'+
		'To date, the United States is the only country to have successfully conducted manned missions to the Moon, with the last departing the lunar surface in December 1972. All manned and unmanned soft landings had taken place on the near side of the Moon, until 3 January 2019 when the Chinese Change 4 spacecraft made the first landing on the far side of the Moon.',
		links: "https://en.wikipedia.org/wiki/Moon_landing"
	},
	{	title: "Broadcast flag",
		summary: 'A broadcast flag is a set of status bits (or a "flag") sent in the data stream of a digital television program that indicates whether or not the data stream can be recorded, or if there are any restrictions on recorded content. Possible restrictions include the inability to save an unencrypted digital program to a hard disk or other non-volatile storage, inability to make secondary copies of recorded content (in order to share or archive), forceful reduction of quality when recording (such as reducing high-definition video to the resolution of standard TVs), and inability to skip over commercials.',
		links: "https://en.wikipedia.org/wiki/Broadcast_flag"
	}
]

index = Math.floor(Math.random() * myData.length);

var article = myData[index];

document.getElementById("article-title").innerHTML = article.title;
document.getElementById("article-summary").innerHTML = article.summary;
document.getElementById("article-link").href = article.links;