var myData = [
	{
		title: "Self-refuting idea",
		summary: "Self-refuting ideas or self-defeating ideas are ideas or statements whose falsehood is a logical consequence of the act or situation of holding them to be true. Many ideas are called self-refuting by their detractors, and such accusations are therefore almost always controversial, with defenders stating that the idea is being misunderstood or that the argument is invalid. For these reasons, none of the ideas below are unambiguously or incontrovertibly self-refuting. These ideas are often used as axioms, which are definitions taken to be true (tautological assumptions), and cannot be used to test themselves, for doing so would lead to only two consequences: consistency (circular reasoning) or exception (self-contradiction). It is important to know that the conclusion of an argument that is self-refuting is not necessarily false, since it could be supported by another, more valid, argument.",
		links: "https://en.wikipedia.org/wiki/Self-refuting_idea"
	},
	{
		title: "Freethought",
		summary: "Freethought (or 'free thought')[1] is a philosophical viewpoint which holds that positions regarding truth should be formed on the basis of logic, reason, and empiricism, rather than authority, tradition, revelation, or dogma. According to the Oxford English Dictionary [2], a freethinker is 'a person who forms their own ideas and opinions rather than accepting those of other people, especially in religious teaching.' In some contemporary thought in particular, freethought is strongly tied with rejection of traditional social or religious belief systems.[1][3] The cognitive application of freethought is known as 'freethinking', and practitioners of freethought are known as 'freethinkers'.[1] Modern freethinkers consider freethought as a natural freedom of all negative and illusive thoughts acquired from the society."+'<br><br>'+'The term first came into use in the 17th century in order to indicate people who inquired into the basis of traditional religious beliefs. In practice, freethinking is most closely linked with secularism, atheism, agnosticism, anti-clericalism, and religious critique. The Oxford English Dictionary defines freethinking as, "The free exercise of reason in matters of religious belief, unrestrained by deference to authority; the adoption of the principles of a free-thinker." Freethinkers hold that knowledge should be grounded in facts, scientific inquiry, and logic. The skeptical application of science implies freedom from the intellectually limiting effects of confirmation bias, cognitive bias, conventional wisdom, popular culture, prejudice, or sectarianism.',
		links: "https://en.wikipedia.org/wiki/Freethought"
	},
	{
		title: "Argument map",
		summary: "In informal logic and philosophy, an argument map or argument diagram is a visual representation of the structure of an argument. An argument map typically includes the key components of the argument, traditionally called the conclusion and the premises, also called contention and reasons.[1] Argument maps can also show co-premises, objections, counterarguments, rebuttals, and lemmas. There are different styles of argument map but they are often functionally equivalent and represent an argument's individual claims and the relationships between them."+'<br><br>'+"Argument maps are commonly used in the context of teaching and applying critical thinking.[2] The purpose of mapping is to uncover the logical structure of arguments, identify unstated assumptions, evaluate the support an argument offers for a conclusion, and aid understanding of debates. Argument maps are often designed to support deliberation of issues, ideas and arguments in wicked problems."+'<br><br>'+"An argument map is not to be confused with a concept map or a mind map, two other kinds of node–link diagram which have different constraints on nodes and links.",
		links: "https://en.wikipedia.org/wiki/Argument_map"
	},
	{	title: "Reactive synthesis",
		summary: 'Reactive synthesis (or temporal synthesis) is the field of computer science that studies automatic generation of state machines (e.g. Moore machines) from high-level specifications (e.g. formulas in linear temporal logic). "Reactivity" highlights the fact that the synthesized machine interacts with the user, reading an input and producing an output, and never stops its operation.'
		+'<br><br>'+
		'The synthesis problem was introduced by Alonzo Church in 1962 [1], with specifications being formulas in monadic second-order logic and state machines in the form of digital circuits.',
		links: "https://en.wikipedia.org/wiki/Reactive_synthesis"
	},
	{	title: "Vacuous truth",
		summary: 'In mathematics and logic, a vacuous truth is a statement that asserts that all members of the empty set have a certain property. For example, the statement "all cell phones in the room are turned off" will be true whenever there are no cell phones in the room. In this case, the statement "all cell phones in the room are turned on" would also be vacuously true, as would the conjunction of the two: "all cell phones in the room are turned on and turned off".'
		+'<br><br>'+
		'More formally, a relatively well-defined usage refers to a conditional statement with a false antecedent. One example of such a statement is "if Uluru is in France, then the Eiffel Tower is in Bolivia". Such statements are considered vacuous because the fact that the antecedent is false prevents using the statement to infer anything about the truth value of the consequent. They are true because a material conditional is defined to be true when the antecedent is false (regardless of whether the conclusion is true).'
		+'<br><br>'+
		'In pure mathematics, vacuously true statements are not generally of interest by themselves, but they frequently arise as the base case of proofs by mathematical induction.[1] This notion has relevance in pure mathematics, as well as in any other field that uses classical logic.'
		+'<br><br>'+
		"Outside of mathematics, statements which can be characterized informally as vacuously true can be misleading. Such statements make reasonable assertions about qualified objects which do not actually exist. For example, a child might tell their parent 'I ate every vegetable on my plate', when there were no vegetables on the child's plate to begin with.",
		links: "https://en.wikipedia.org/wiki/Vacuous_truth"
	},
	{	title: "Narrative logic",
		summary: "Narrative logic describes any logical process of narrative analysis used by readers or viewers to understand and draw conclusions from narratives. Narrative logic is a tool through which the audience may infer actions, events, intentions, thoughts, beliefs, values, and feelings of characters and narrators, or otherwise elucidate details not included in the narrative. For example, if a character is in Paris in one scene and in Nice the next, the audience can infer that she traveled, and later references to that travel will not be illogical or unexplainable simply because the trip was not explicitly described. In the same way, if a gun is shown in the drawer of a character's desk, the audience can infer that the gun will be or has been used in some way relevant to the plot. Authors will often play with conventional patterns of narrative logic by attempting to plant 'false leads' or to hide important clues, leading audiences to improper conclusions or even to doubt their sense of what is really happening."
		+'<br><br>'+
		"It is necessary to build a logical argument based upon the content of a narrative, using its events and rhetoric as evidence to infer other elements necessary to produce a coherent and consistent plot, theme, and argument. This is done to ensure that one's argument does not contradict or alter the narrative itself. Problems and disagreements may arise from this fixity of the narrative because it should also preclude alteration of the artistic statement being conveyed, something that is open to subjective interpretation and may be paradoxical or illogical in itself. Thus, this process is generally imperfect since, as with all narrative analysis and most forms of logic, different applications and interpretations can lead to differing conclusions"
		+'<br><br>'+
		'Narrative logic becomes explicit or even labored to create continuity where there is a plot hole or some intentional gap in a narrative, or to explain other unresolved issues within a narrative (i.e. questions such as "Did this character die or simply disappear?" or "Why did two instances under the same circumstances lead to different results?"). It may also be used for other purposes, such as answering theoretical questions derived from the narrative (i.e. "What would happen if...?" or "Who would win in a battle between...?"). In a broader sense it is used in devices such as character development, since a character is defined by the interpretations of its actions and the rhetoric used to describe it.',
		links: "https://en.wikipedia.org/wiki/Narrative_logic"
	},
	{	title: "Informal logic",
		summary: 'Informal logic, intuitively, refers to the principles of logic and logical thought outside of a formal setting. However, perhaps because of the "informal" in the title, the precise definition of "informal logic" is a matter of some dispute.[1] Ralph H. Johnson and J. Anthony Blair define informal logic as "a branch of logic whose task is to develop non-formal standards, criteria, procedures for the analysis, interpretation, evaluation, criticism and construction of argumentation."[2] This definition reflects what had been implicit in their practice and what others were doing in their informal logic texts.'
		+'<br><br>'+
		'Informal logic is associated with (informal) fallacies, critical thinking, the thinking skills movement[3] and the interdisciplinary inquiry known as argumentation theory. Frans H. van Eemeren writes that the label "informal logic" covers a "collection of normative approaches to the study of reasoning in ordinary language that remain closer to the practice of argumentation than formal logic."',
		links: "https://en.wikipedia.org/wiki/Informal_logic"
	}
]

index = Math.floor(Math.random() * myData.length);

var article = myData[index];

document.getElementById("article-title").innerHTML = article.title;
document.getElementById("article-summary").innerHTML = article.summary;
document.getElementById("article-link").href = article.links;