var myData = [
	{
		title: "The Witch of Atlas",
		summary: "The Witch of Atlas is a major poetic work of the English romantic poet Percy Bysshe Shelley written in 1820 and published posthumously in 1824 in the Posthumous Poems collection. The poem was written in 78 ottava rima stanzas during the period when Prometheus Unbound and The Cloud were written and reflects similar themes. The theme of the poem is a quest for the perfect union."+'<br><br>'+"British composer Sir Granville Bantock wrote a tone poem for orchestra based on the Shelley poem in 1902, The Witch of Atlas: Tone Poem for Orchestra No.5 after Shelley, which was first performed on 10 September 1902.",
		links: "https://en.wikipedia.org/wiki/The_Witch_of_Atlas"
	},
	{
		title: "Luminous gemstones",
		summary: "Folktales about luminous gemstones are an almost worldwide motif in mythology and history among Asian, European, African, and American cultures. Some stories about light-emitting gems may have been based on luminescent and phosphorescent minerals such as diamonds.",
		links: "https://en.wikipedia.org/wiki/Luminous_gemstones"
	},
	{
		title: "2012 phenomenon",
		summary: "The 2012 phenomenon was a range of eschatological beliefs that cataclysmic or otherwise transformative events would occur on or around 21 December 2012.[1] This date was regarded as the end-date of a 5,126-year-long cycle in the Mesoamerican Long Count calendar,[2] and as such, festivities to commemorate the date took place on 21 December 2012 in the countries that were part of the Maya civilization (Mexico, Guatemala, Honduras, and El Salvador), with main events at Chichén Itzá in Mexico, and Tikal in Guatemala."+'<br><br>'+"Various astronomical alignments and numerological formulae were proposed as pertaining to this date. A New Age interpretation held that the date marked the start of a period during which Earth and its inhabitants would undergo a positive physical or spiritual transformation, and that 21 December 2012 would mark the beginning of a new era.[6] Others suggested that the date marked the end of the world or a similar catastrophe. Scenarios suggested for the end of the world included the arrival of the next solar maximum, an interaction between Earth and the supermassive black hole at the center of the galaxy,[7] or Earth's collision with a mythical planet called Nibiru."+'<br><br>'+"Scholars from various disciplines quickly dismissed predictions of concomitant cataclysmic events as they arose. Professional Mayanist scholars stated that no extant classic Maya accounts forecast impending doom, and that the idea that the Long Count calendar ends in 2012 misrepresented Maya history and culture,[8][9][10] while astronomers rejected the various proposed doomsday scenarios as pseudoscience,[11][12] easily refuted by elementary astronomical observations.",
		links: "https://en.wikipedia.org/wiki/2012_phenomenon"
	}
]

index = Math.floor(Math.random() * myData.length);

var article = myData[index];

document.getElementById("article-title").innerHTML = article.title;
document.getElementById("article-summary").innerHTML = article.summary;
document.getElementById("article-link").href = article.links;