var myData = [
	{
		title: "Concrete number",
		summary: 'A concrete number or numerus numeratus is a number associated with the things being counted, in contrast to an abstract number or numerus numerans which is a number as a single entity. For example, "five apples" and "half of a pie" are concrete numbers, while "five" and "one half" are abstract numbers. In mathematics the term "number" is usually taken to mean an abstract number. A denominate number is a type of concrete number with a unit of measure attached with it. For example, "5 inches" is a denominate number because it has the unit inches after it.',
		links: "https://en.wikipedia.org/wiki/Concrete_number"
	},
	{
		title: "Illegal number",
		summary: "An illegal number is a number that represents information which is illegal to possess, utter, propagate, or otherwise transmit in some legal jurisdiction. Any piece of digital information is representable as a number; consequently, if communicating a specific set of information is illegal in some way, then the number may be illegal as well.",
		links: "https://en.wikipedia.org/wiki/Illegal_number"
	},
	{
		title: "Fuzzy number",
		summary: "A fuzzy number is a generalization of a regular, real number in the sense that it does not refer to one single value but rather to a connected set of possible values, where each possible value has its own weight between 0 and 1[1]. This weight is called the membership function. A fuzzy number is thus a special case of a convex, normalized fuzzy set of the real line.[2] Just like Fuzzy logic is an extension of Boolean logic (which uses absolute truth and falsehood only, and nothing in between), fuzzy numbers are an extension of real numbers. Calculations with fuzzy numbers allow the incorporation of uncertainty on parameters, properties, geometry, initial conditions, etc.",
		links: "https://en.wikipedia.org/wiki/Fuzzy_number"
	},
	{	title: "Ideal number",
		summary: "In number theory an ideal number is an algebraic integer which represents an ideal in the ring of integers of a number field; the idea was developed by Ernst Kummer, and led to Richard Dedekind's definition of ideals for rings. An ideal in the ring of integers of an algebraic number field is principal if it consists of multiples of a single element of the ring, and nonprincipal otherwise. By the principal ideal theorem any nonprincipal ideal becomes principal when extended to an ideal of the Hilbert class field. This means that there is an element of the ring of integers of the Hilbert class field, which is an ideal number, such that the original nonprincipal ideal is equal to the collection of all multiples of this ideal number by elements of this ring of integers that lie in the original field's ring of integers.",
		links: "https://en.wikipedia.org/wiki/Ideal_number"
	},
	{	title: "Round number",
		summary: 'A round number is mathematically defined as the product of a considerable number of comparatively small factors[1][2] as compared to its neighbouring numbers, such as 24 = 2*2*2*3 (4 factors, as opposed to 3 factors for 27; 2 factors for 21, 22, 25, and 26; and 1 factor for 23).'
		+'<br><br>'+
		'A round number is informally considered to be an integer that ends with one or more "0"s (zero-digit) in a given base.[3] So, 590 is rounder than 592, but 590 is less round than 600. In both technical and informal language, a round number is often interpreted to stand for a value or values near to the nominal value expressed. For instance, a round number such as 600 might be used to refer to a value whose magnitude is actually 592, because the actual value is more cumbersome to express exactly. Likewise, a round number may be used to refer to a range of values near the nominal value that expresses imprecision about a quantity.[4] Thus, a value reported as 600 might actually represent any value near 600, possibly as low as 550 or as high as 650, all of which would round to 600.'
		+'<br><br>'+
		'In decimal notation, a number ending in the digit "5" is also considered more round than one ending in another non-zero digit (but less round than any which ends with "0").[4][5] For example, the number 25 tends to be seen as more round than 24. Thus someone might say, upon turning 45, that their age is more round than when they turn 44 or 46. These notions of roundness are also often applied to non-integer numbers; so, in any given base, 2.3 is rounder than 2.297, because 2.3 can be written as 2.300. Thus, a number with fewer digits which are not trailing "0"s is considered to be rounder than others of the same or greater precision.'
		+'<br><br>'+
		'Numbers can also be considered "round" in numbering systems other than decimal (base 10). For example, the number 1024 would not be considered round in decimal, but the same number ends with a zero in several other numbering systems including binary (base 2: 10000000000), octal (base 8: 2000), and hexadecimal (base 16: 400). The previous discussion about the digit "5" generalizes to the digit representing b/2 for base-b notation, if b is even.',
		links: "https://en.wikipedia.org/wiki/Round_number"
	},
	{	title: "Renard series",
		summary: "Renard series are a system of preferred numbers dividing an interval from 1 to 10 into 5, 10, 20, or 40 steps.[1] This set of preferred numbers was proposed in the 1877 by French army engineer Colonel Charles Renard.[2][3][4] His system was adopted by the ISO in 1949[5] to form the ISO Recommendation R3, first published in 1953[6] or 1954, which evolved into the international standard ISO 3.[1] Renard's system of preferred numbers divides the interval from 1 to 10 into 5, 10, 20, or 40 steps. The factor between two consecutive numbers in a Renard series is approximately constant (before rounding), namely the 5th, 10th, 20th, or 40th root of 10 (approximately 1.58, 1.26, 1.12, and 1.06, respectively), which leads to a geometric sequence. This way, the maximum relative error is minimized if an arbitrary number is replaced by the nearest Renard number multiplied by the appropriate power of 10. One application of the Renard series of numbers is to current rating of electric fuses.",
		links: "https://en.wikipedia.org/wiki/Renard_series"
	},
	{	title: "Regnal number",
		summary: "Regnal numbers are ordinal numbers used to distinguish among persons with the same name who held the same office. Most importantly, they are used to distinguish monarchs. An ordinal is the number placed after a monarch's regnal name to differentiate between a number of kings, queens or princes reigning the same territory with the same regnal name."
		+'<br><br>'+
		'It is common to start counting either since the beginning of the monarchy, or since the beginning of a particular line of state succession. For example, Boris III of Bulgaria and his son Simeon II were given their regnal numbers because the medieval rulers of the First and Second Bulgarian Empire were counted as well even if the present Bulgarian state dated only back to 1878 and were only distantly related to the previous Bulgarian states.[citation needed] On the other hand, the kings of England were counted starting with the Norman conquest of England. That is why the son of Henry III of England is counted as Edward I, even though there were three Edwards before the conquest.'
		+'<br><br>'+
		"Sometimes legendary or fictional persons are included. For example, the Swedish kings Eric XIV (reigned 1560–68) and Charles IX (1604–11) took ordinals based on a fanciful 1544 history by Johannes Magnus, which invented six kings of each name before those accepted by later historians.[1] A list of Swedish monarchs, represented on the map of the Estates of the Swedish Crown [2], performed by French engraver Jacques Chiquet (1673-1721) and published in Paris in 1719, starts with Canute I and shows Eric XIV and Charles IX as Eric IV and Charles II respectively; the only Charles holding his traditional ordinal in the list is Charles XII."
		+'<br><br>'+
		"In any case, it is usual to count only the monarchs or heads of the family, and to number them sequentially up to the end of the dynasty.[citation needed] A notable exception to this rule is the German House of Reuss. This family has the particularity that every male member during the last centuries was named Heinrich, and all of them, not only the head of the family, were numbered. While the members of the elder branch were numbered in order of birth until the extinction of the branch in 1927, the members of the younger line were (and still are) numbered in sequences that began and ended roughly as centuries began and ended. This explains why the current (since 2012) head of the Reuss family is called Heinrich XIV, his late father Heinrich IV and his sons Heinrich XXIX and Heinrich V.",
		links: "https://en.wikipedia.org/wiki/Regnal_number"
	}
]

index = Math.floor(Math.random() * myData.length);

var article = myData[index];

document.getElementById("article-title").innerHTML = article.title;
document.getElementById("article-summary").innerHTML = article.summary;
document.getElementById("article-link").href = article.links;