var myData = [
	{
		title: "Animal nutritionist",
		summary: 'An animal nutritionist is a person who specializes in animal nutrition, which is especially concerned with the dietary needs of animals in captivity: livestock, pets, and animals in wildlife rehabilitation facilities.'+'<br><br>'+"The science of animal nutrition encompasses principles of chemistry (especially biochemistry), physics, mathematics, ethology (animal behavior). An animal nutrition in the food industry may also be concerned with economics and food processing.",
		links: "https://en.wikipedia.org/wiki/Animal_nutritionist"
	},
	{
		title: "Microgreen",
		summary: 'Microgreens are a vegetable green, harvested after the Cotyledon leaves have developed, not to be confused with sprouts or shoots, that are used both as a visual and flavor component or ingredient primarily in fine dining restaurants. Fine dining chefs use microgreens to enhance the attractiveness and taste of their dishes with their delicate textures and distinctive flavors. Smaller than “baby greens,” and harvested later than sprouts, microgreens can provide a variety of leaf flavors, such as sweet and spicy. They are also known for their various colors and textures. Among upscale markets, they are now considered a specialty genre of greens that are good for garnishing salads, soups, plates, and sandwiches.'+'<br><br>'+'Edible young greens and grains are produced from various kinds of vegetables, herbs or other plants. They range in size from 1 to 3 inches (2.5 to 7.6 cm), including the stem and leaves. A microgreen has a single central stem which has been cut just above the soil line during harvesting. It has fully developed cotyledon leaves and usually has one pair of very small, partially developed true leaves. The average crop-time for most microgreens is 10–14 days from seeding to harvest.',
		links: "https://en.wikipedia.org/wiki/Microgreen"
	},
	{
		title: "Fatty acid",
		summary: "In chemistry, particularly in biochemistry, a fatty acid is a carboxylic acid with a long aliphatic chain, which is either saturated or unsaturated. Most naturally occurring fatty acids have an unbranched chain of an even number of carbon atoms, from 4 to 28.[1] Fatty acids are usually not found in organisms, but instead as three main classes of esters: triglycerides, phospholipids, and cholesterol esters. In any of these forms, fatty acids are both important dietary sources of fuel for animals and they are important structural components for cells.",
		links: "https://en.wikipedia.org/wiki/Fatty_acid"
	},
	{	title: "Saturated fat",
		summary: "A saturated fat is a type of fat in which the fatty acid chains have all or predominantly single bonds. A fat is made of two kinds of smaller molecules: glycerol and fatty acids. Fats are made of long chains of carbon (C) atoms. Some carbon atoms are linked by single bonds (-C-C-) and others are linked by double bonds (-C=C-).[1] Double bonds can react with hydrogen to form single bonds. They are called saturated, because the second bond is broken and each half of the bond is attached to (saturated with) a hydrogen atom. Most animal fats are saturated. The fats of plants and fish are generally unsaturated.[1] Saturated fats tend to have higher melting points than their corresponding unsaturated fats, leading to the popular understanding that saturated fats tend to be solids at room temperatures, while unsaturated fats tend to be liquid at room temperature with varying degrees of viscosity (meaning both saturated and unsaturated fats are found to be liquid at body temperature)."
		+'<br><br>'+
		"Various fats contain different proportions of saturated and unsaturated fat. Examples of foods containing a high proportion of saturated fat include animal fat products such as cream, cheese, butter, other whole milk dairy products and fatty meats which also contain dietary cholesterol.[2] Certain vegetable products have high saturated fat content, such as coconut oil and palm kernel oil.[3] Many prepared foods are high in saturated fat content, such as pizza, dairy desserts, and sausage."
		+'<br><br>'+
		"Guidelines released by many medical organizations, including the World Health Organization, have advocated for reduction in the intake of saturated fat to promote health and reduce the risk from cardiovascular diseases. Many review articles also recommend a diet low in saturated fat and argue it will lower risks of cardiovascular diseases,[5] diabetes, or death.[6] A small number of contemporary reviews have challenged these conclusions, though predominant medical opinion is that saturated fat and cardiovascular disease are closely related",
		links: "https://en.wikipedia.org/wiki/Saturated_fat"
	},
	{	title: "Health effects of salt",
		summary: "The health effects of salt are the conditions associated with the consumption of either too much or too little salt. Salt is a mineral composed primarily of sodium chloride (NaCl) and is used in food for both preservation and flavor. Sodium ions are needed in small quantities by most living things, as are chloride ions. Salt is involved in regulating the water content (fluid balance) of the body. The sodium ion itself is used for electrical signaling in the nervous system."
		+'<br><br>'+
		"The Centers for Disease Control and Prevention (CDC) states that excess sodium can increase blood pressure and the risk for heart disease and stroke in some individuals.[2] Therefore, health authorities recommend limitations on dietary sodium.[3][4][5][6] The United States Department of Health and Human Services recommends that individuals consume no more than 1500–2300 mg of sodium (3750–5750 mg of salt) per day[2][7] depending on race, medical condition and age.[8] The World Health Organization recommends that adults consume no more than 5 g of salt per day."
		+'<br><br>'+
		"As an essential nutrient, sodium is involved in numerous cellular and organ functions. Salt intake that is too low, below 3 g per day, may also increase risk for cardiovascular disease and early death.",
		links: "https://en.wikipedia.org/wiki/Health_effects_of_salt"
	},
	{	title: "Unsaturated fat",
		summary: "An unsaturated fat is a fat or fatty acid in which there is at least one double bond within the fatty acid chain. A fatty acid chain is monounsaturated if it contains one double bond, and polyunsaturated if it contains more than one double bond."
		+'<br><br>'+
		'Where double bonds are formed, hydrogen atoms are subtracted from the carbon chain. Thus, a saturated fat has no double bonds, has the maximum number of hydrogens bonded to the carbons, and therefore is "saturated" with hydrogen atoms. In cellular metabolism, unsaturated fat molecules contain somewhat less energy (i.e., fewer calories) than an equivalent amount of saturated fat. The greater the degree of unsaturation in a fatty acid (i.e., the more double bonds in the fatty acid) the more vulnerable it is to lipid peroxidation (rancidity). Antioxidants can protect unsaturated fat from lipid peroxidation.',
		links: "https://en.wikipedia.org/wiki/Unsaturated_fat"
	},
	{	title: "Puppy nutrition",
		summary: "The developmental life stage of dogs requires a specific intake of nutrients to ensure proper growth and development and to meet energy requirements. Despite the fact that puppies have different nutritional requirements compared to their adult counterparts, of the 652 breeders surveyed in the United States and Canada in 2012, 8.7% report feeding puppies commercial diets not intended for the developmental life stage of canines.[1] Large and small dog breeds have even more specific nutrient requirements during growth, such as adjusted calcium to phosphorus ratio, and as such should receive a breed specific growth formula.[2] Feeding diets formulated by a nutritionist for specific breed and life stage differences in nutrient requirements ensures a growing puppy will receive the proper nutrition associated with appropriate skeletal, neurological and immune development. This includes nutrients such as protein, fibre, essential fatty acids, calcium and vitamin E.[3][4][5] It is therefore important to feed puppies a diet that meets the minimum and/or maximum requirements established by the National Research Council."
		+'<br><br>'+
		"The nutritional requirements determined by the NRC are based on scientific evidence and used as the basis for nutritional adequacy in cats and dogs. However, these values are based on the assumption that the availability and digestibility of the nutrients are not variable, although in reality, this is not the case. The Association of American Feed Control Officials (AAFCO) also has recommended nutrient levels, but their values serve primarily as regulatory guidance. AAFCO bases their recommendations on feeding trials and are not necessarily supported by scientific evidence; however their nutritional adequacy statement on pet food bags is considered an important part of the label because their recommendations account for ingredient variability. Other agencies involved in pet food regulations include the FDA in the United States who directly regulates the sales of pet food, the FEDIAF in Europe and PFIAA in Australia who recommend regulatory requirements for the pet food industry, as well as others. When selecting puppy food, it is important to consult the labels and ensure products meet the standards of regulatory agencies of your respective country.",
		links: "https://en.wikipedia.org/wiki/Puppy_nutrition"
	}
]

index = Math.floor(Math.random() * myData.length);

var article = myData[index];

document.getElementById("article-title").innerHTML = article.title;
document.getElementById("article-summary").innerHTML = article.summary;
document.getElementById("article-link").href = article.links;