var myData = [
	{
		title: "Etiquette",
		summary: "Etiquette (/ˈɛtɪˌkɛt/ or /ˈɛtɪkɪt/, French: [e.ti.kɛt]) is a code of behavior that delineates expectations for social behavior according to contemporary conventional norms within a society, social class, or group."+'<br><br>'+"The French word étiquette, literally signifying a tag or label, was used in a modern sense in English around 1750.[2] Etiquette is behaviour that assists survival and has changed and evolved over the years.",
		links: "https://en.wikipedia.org/wiki/Etiquette"
	},
	{
		title: "Hollywood Life",
		summary: "Hollywood Life is an American entertainment website at Hollywoodlife.com launched in 2009 as part of Penske Media Corporation by longtime magazine editor Bonnie Fuller, who is the former editor of the magazines Cosmopolitan, Glamour, and Us Weekly.[2] The site covers celebrity, fashion, beauty, and entertainment news."+'<br><br>'+"Hollywood Life also offers live coverage of awards shows and other notable pop culture events. In June 2015, Hollywood Life and PIX11, Tribune Broadcasting's New York flagship station, announced a content and cross-promotional partnership across all platforms. As part of the collaboration, Hollywood Life now provides PIX11 News with content on air and on PIX11.com. Additionally, Bonnie Fuller is a regular contributor along with the outlet's senior entertainment reporter Chloe Melas and fashion editor Katrina Mitzeliotis."+'<br><br>'+"The website began airing a weekly podcast in January 2015, hosted by editor-in-chief Bonnie Fuller, which includes discussion, debate and exclusives on celebrity news.",
		links: "https://en.wikipedia.org/wiki/Hollywood_Life"
	},
	{
		title: "Middlebrow",
		summary: 'The term middlebrow describes easily accessible art, usually literature, and the people who use the arts to acquire culture and "class" (social prestige). First used in the British satire magazine Punch in 1925, the term middlebrow is the intermediary "brow" descriptor between highbrow and lowbrow, which are terms derived from the pseudo-science of phrenology.'+'<br><br>'+'The term middlebrow became a pejorative usage in the modernist cultural criticism, by Dwight Macdonald, Virginia Woolf, and Russell Lynes, which served the cause of the marginalization of the popular culture in favor of high culture.[2] Culturally, the middlebrow is classed as a forced and ineffective attempt at cultural and intellectual achievement, and as characterizing literature that emphasizes emotional and sentimental connections, rather than intellectual quality and literary innovation;[3] although postmodernism more readily perceives the advantages of the middlebrow cultural-position that is aware of high culture, but is able to balance aesthetic claims with the claims of the everyday world.',
		links: "https://en.wikipedia.org/wiki/Middlebrow"
	},
	{	title: "Cultural icon",
		summary: 'A cultural icon is an artifact that is identified by members of a culture as representative of that culture. The process of identification is subjective, and "icons" are judged by the extent to which they can be seen as an authentic proxy of that culture. When individuals perceive a cultural icon, they relate it to their general perceptions of the cultural identity represented.[1] Cultural icons can also be identified as an authentic representation of the practices of one culture by another.'
		+'<br><br>'+
		'In the media, many items and persons of popular culture have been called "iconic" despite their lack of durability, and the term "pop icon" is often now used synonymously. Some commentators believe that the word is overused or misused.'
		+'<br><br>'+
		"The values, norms and ideals represented by a cultural icon vary both among people who subscribe to it, and more widely among other people who may interpret cultural icons as symbolising quite different values. Thus an apple pie is a cultural icon of the United States', but its significance varies among Americans."
		+'<br><br>'+
		"National icons can become targets for those opposing or criticising a regime, for example, crowds destroying statues of Lenin in Eastern Europe after the fall of communism[4] or burning the American flag to protest US actions abroad."
		+'<br><br>'+
		"Religious icons can also become cultural icons in societies where religion and culture are deeply entwined, such as representations of the Madonna in societies with a strong Catholic tradition.",
		links: "https://en.wikipedia.org/wiki/Cultural_icon"
	},
	{	title: "Pizza",
		summary: "Pizza (Italian: [ˈpittsa], Neapolitan: [ˈpittsə]) is a savory dish of Italian origin, consisting of a usually round, flattened base of leavened wheat-based dough topped with tomatoes, cheese, and various other ingredients (anchovies, olives, meat, etc.) baked at a high temperature, traditionally in a wood-fired oven.[1] In formal settings, like a restaurant, pizza is eaten with knife and fork, but in casual settings it is cut into wedges to be eaten while held in the hand. Small pizzas are sometimes called pizzettas."
		+'<br><br>'+
		"The term pizza was first recorded in the 10th century in a Latin manuscript from the Southern Italian town of Gaeta in Lazio, on the border with Campania.[2] Modern pizza was invented in Naples, and the dish and its variants have since become popular in many countries.[3] It has become one of the most popular foods in the world and a common fast food item in Europe and North America, available at pizzerias (restaurants specializing in pizza), restaurants offering Mediterranean cuisine, and via pizza delivery.[3][4] Many companies sell ready-baked frozen pizzas to be reheated in an ordinary home oven."
		+'<br><br>'+
		"The Associazione Verace Pizza Napoletana (lit. True Neapolitan Pizza Association) is a non-profit organization founded in 1984 with headquarters in Naples that aims to promote traditional Neapolitan pizza.[5] In 2009, upon Italy's request, Neapolitan pizza was registered with the European Union as a Traditional Speciality Guaranteed dish,[6][7] and in 2017 the art of its making was included on UNESCO's list of intangible cultural heritage.",
		links: "https://en.wikipedia.org/wiki/Pizza"
	},
	{	title: "Selling out",
		summary: "'Selling out' is a common idiomatic pejorative expression for the compromising of a person's integrity, morality, authenticity, or principles in exchange for personal gain, such as money.[1] In terms of music or art, selling out is associated with attempts to tailor material to a mainstream or commercial audience. For example, a musician who alters his material to encompass a wider audience, and in turn generates greater revenue, may be labeled by fans who pre-date the change as a 'sellout.' A sellout also refers to someone who gives up, or disregards, hence the term 'sells' – someone or something – for some other thing or person. The term could also be used as 'sold out' depending on the context.",
		links: "https://en.wikipedia.org/wiki/Selling_out"
	},
	{	title: "Credibility",
		summary: 'Credibility comprises the objective and subjective components of the believability of a source or message.'
		+'<br><br>'+
		"Credibility has two key components: trustworthiness and expertise, which both have objective and subjective components. Trustworthiness is based more on subjective factors, but can include objective measurements such as established reliability. Expertise can be similarly subjectively perceived, but also includes relatively objective characteristics of the source or message (e.g., credentials, certification or information quality).[1] Secondary components of credibility include source dynamism (charisma) and physical attractiveness."
		+'<br><br>'+
		"Credibility online has become an important topic since the mid-1990s. This is because the web has increasingly become an information resource. The Credibility and Digital Media Project @ UCSB[2] highlights recent and ongoing work in this area, including recent consideration of digital media, youth, and credibility. In addition, the Persuasive Technology Lab[3] at Stanford University has studied web credibility and proposed the principal components of online credibility and a general theory called Prominence-Interpretation Theory.",
		links: "https://en.wikipedia.org/wiki/Credibility"
	}
]

index = Math.floor(Math.random() * myData.length);

var article = myData[index];

document.getElementById("article-title").innerHTML = article.title;
document.getElementById("article-summary").innerHTML = article.summary;
document.getElementById("article-link").href = article.links;