var myData = [
	{
		title: "Divine inspiration",
		summary: "Divine inspiration is the concept of a supernatural force, typically a deity, causing a person or people to experience a creative desire. It has been a commonly reported aspect of many religions, for thousands of years. Divine inspiration is often closely tied to the concept of revelation, the belief in information being revealed or disclosed through communication with a deity or other supernatural entity or entities.",
		links: "https://en.wikipedia.org/wiki/Divine_inspiration"
	},
	{
		title: "Noble lie",
		summary: "In politics, a noble lie is a myth or untruth, often, but not invariably, of a religious nature, knowingly propagated by an elite to maintain social harmony or to advance an agenda. The noble lie is a concept originated by Plato as described in the Republic."+'<br><br>'+"In religion, a pious fiction is a narrative that is presented as true by the author, but is considered by others to be fictional albeit produced with an altruistic motivation. The term is sometimes used pejoratively to suggest that the author of the narrative was deliberately misleading readers for selfish or deceitful reasons. The term is often used in religious contexts, sometimes referring to passages in religious texts.",
		links: "https://en.wikipedia.org/wiki/Noble_lie"
	},
	{
		title: "Nature religion",
		summary: "A nature religion is a religious movement that believes nature and the natural world is an embodiment of divinity, sacredness or spiritual power.[1] Nature religions include indigenous religions practiced in various parts of the world by cultures who consider the environment to be imbued with spirits and other sacred entities. It also includes contemporary Pagan faiths which are primarily concentrated in Europe and North America."+'<br><br>'+"The term 'nature religion' was first coined by the American religious studies scholar Catherine Albanese, who used it in her work Nature Religion in America: From the Algonkian Indians to the New Age (1991) and later went on to use it in other studies. Following on from Albanese's development of the term it has since been used by other academics working in the discipline.",
		links: "https://en.wikipedia.org/wiki/Nature_religion"
	},
	{	title: "World religions",
		summary: 'World religions is a category used in the study of religion to demarcate the five—and in some cases six—largest and most internationally widespread religious movements. Christianity, Islam, Judaism, Hinduism, and Buddhism are always included in the list, being known as the "Big Five". Some scholars also include another religion, such as Sikhism, Zoroastrianism, or the Baháí Faith, in the category.'
		+'<br><br>'+
		"The world religions paradigm was developed in the United Kingdom in the 1960s, where it was pioneered by phenomenological scholars like Ninian Smart. It was designed to broaden the study of religion away from its heavy focus on Christianity by taking into account other large religious traditions around the world. The paradigm is often used by lecturers instructing undergraduate students in the study of religion and is also the framework used by school teachers in the UK and other countries. The paradigm's emphasis on viewing these religious movements as distinct and mutually exclusive entities has also had a wider impact on the categorisation of religion—for instance in censuses—in both Western countries and elsewhere."
		+'<br><br>'+
		'Since the late twentieth century, the paradigm has faced critique by scholars of religion like Jonathan Z. Smith, some of whom have argued for its abandonment. Critics have argued that the world religions paradigm is inappropriate because it takes the Protestant variant of Christianity as the model for what constitutes religion; that it is tied up with discourses of modernity, including modern power relations; that it encourages an uncritical understanding of religion; and that it makes a value judgement as to what religions should be considered "major". Others have argued that it remains useful in the classroom, so long as students are made aware that it is a socially constructed category.',
		links: "https://en.wikipedia.org/wiki/World_religions"
	},
	{	title: "Deistic evolution",
		summary: "Deistic evolution is a position in the origins debate which involves accepting the scientific evidence for evolution and age of the universe whilst advocating the view that a deistic God created the universe but has not interfered since. The position is a counterpoint to theistic evolution and is endorsed by those who believe in both deism and the veracity of science.",
		links: "https://en.wikipedia.org/wiki/Deistic_evolution"
	},
	{	title: "Sacrilege",
		summary: 'Sacrilege is the violation or injurious treatment of a sacred object, site or person. This can take the form of irreverence to sacred persons, places, and things. When the sacrilegious offence is verbal, it is called blasphemy, and when physical, it is often called desecration. In a less proper sense, any transgression against what is seen and making unseen, any transgression against what is seen as the virtue of religion would be a sacrilege, and so is coming near a sacred site without permission, obscuring and relinquishing permission. Destruction of religious objects or sites is the destroying of order and makes a journey difficult. Preparing for a difficult journey requires some sight into the possible, religious permission that is implicitly followed is acceptance of both the possible and impossible, sacrilege prevents both. The term "sacrilege" originates from the Latin sacer, meaning sacred, and legere, meaning to steal. In Roman times it referred to the plundering of temples and graves. By the time of Cicero, sacrilege had adopted a more expansive meaning, including verbal offences against religion and undignified treatment of sacred objects.'
		+'<br><br>'+
		"Most ancient religions have a concept analogous to sacrilege, often considered as a type of taboo. The basic idea is that sacred objects are not to be treated in the same way as other objects because they help us remember hence and we recall. The sycophant, i.e. the use of vulgarity or flattery, is to not recall and thus is harmful to ourselves.",
		links: "https://en.wikipedia.org/wiki/Sacrilege"
	},
	{	title: "Dualistic cosmology",
		summary: 'Dualism in cosmology is the moral or spiritual belief that two fundamental concepts exist, which often oppose each other. It is an umbrella term that covers a diversity of views from various religions, including both traditional religions and scriptural religions.'
		+'<br><br>'+
		"Moral dualism is the belief of the great complement of, or conflict between, the benevolent and the malevolent. It simply implies that there are two moral opposites at work, independent of any interpretation of what might be 'moral' and independent of how these may be represented. Moral opposites might, for example, exist in a worldview which has one god, more than one god, or none. By contrast, duotheism, bitheism or ditheism implies (at least) two gods. While bitheism implies harmony, ditheism implies rivalry and opposition, such as between good and evil, or light and dark, or summer and winter. For example, a ditheistic system could be one in which one god is a creator, and the other a destroyer. In theology, dualism can also refer to the relationship between the deity and creation or the deity and the universe (see theistic dualism). This form of dualism is a belief shared in certain traditions of Christianity and Hinduism.[1] Alternatively, in ontological dualism, the world is divided into two overarching categories. The opposition and combination of the universe's two basic principles of yin and yang is a large part of Chinese philosophy, and is an important feature of Taoism. It is also discussed in Confucianism."
		+'<br><br>'+
		"Many myths and creation motifs with dualistic cosmologies have been described in ethnographic and anthropological literature. These motifs conceive the world as being created, organized, or influenced by two demiurges, culture heroes, or other mythological beings, who either compete with each other or have a complementary function in creating, arranging or influencing the world. There is a huge diversity of such cosmologies. In some cases, such as among the Chukchi, the beings collaborate rather than competing, and contribute to the creation in a coequal way. In many other instances the two beings are not of the same importance or power (sometimes, one of them is even characterized as gullible). Sometimes they can be contrasted as good versus evil.[2] They may be often believed to be twins or at least brothers.[3][4] Dualistic motifs in mythologies can be observed in all inhabited continents. Zolotaryov concludes that they cannot be explained by diffusion or borrowing, but are rather of convergent origin: they are related to a dualistic organization of society (moieties); in some cultures, this social organization may have ceased to exist, but mythology preserves the memory in more and more disguised ways.",
		links: "https://en.wikipedia.org/wiki/Dualistic_cosmology"
	}
]

index = Math.floor(Math.random() * myData.length);

var article = myData[index];

document.getElementById("article-title").innerHTML = article.title;
document.getElementById("article-summary").innerHTML = article.summary;
document.getElementById("article-link").href = article.links;