var myData = [
	{
		title: "Bin picking",
		summary: 'Bin Picking (also referred to as Random Bin Picking[1], even sometimes referred to as "The Holy Grail in Sight"[2]) is a core problem in Computer vision and Robotics. The goal is to have a robot with sensors and cameras attached to it pick-up known objects with random poses out of a bin using a suction gripper, parallel gripper, or other kind of Robot end effector. The company Amazon is known to hold a competition focused on Bin Picking referred to as "Amazon Picking Challenge".[3] Some notable companies actively working on Bin Picking include: VISIO NERF [4], Scape Technologies, FANUC, Motoman, Photoneo, CapSen Robotics, Mujin, Bluewrist Inc., Pick-it.'+'<br><br>'+"Although there can be some overlap, Bin Picking is not to be confused with Each Picking[6][7] or Bin packing problem.",
		links: "https://en.wikipedia.org/wiki/Bin_picking"
	},
	{
		title: "Unmanned aerial vehicle",
		summary: "An unmanned aerial vehicle (UAV), commonly known as a drone, is an aircraft without a human pilot onboard. UAVs are a component of an unmanned aircraft system (UAS); which include a UAV, a ground-based controller, and a system of communications between the two. The flight of UAVs may operate with various degrees of autonomy: either under remote control by a human operator or autonomously by onboard computers."+'<br><br>'+'Compared to manned aircraft, UAVs were originally used for missions too "dull, dirty or dangerous"[3] for humans. While they originated mostly in military applications, their use is rapidly expanding to commercial, scientific, recreational, agricultural, and other applications,[4] such as policing, peacekeeping,[5] and surveillance, product deliveries, aerial photography, smuggling,[6] and drone racing. Civilian UAVs now vastly outnumber military UAVs, with estimates of over a million sold by 2015.',
		links: "https://en.wikipedia.org/wiki/Unmanned_aerial_vehicle"
	},
	{
		title: "Artificial brain",
		summary: "An artificial brain (or artificial mind) is software and hardware with cognitive abilities similar to those of the animal or human brain."+'<br><br>'+'Research investigating "artificial brains" and brain emulation plays three important roles in science:'+'<br><br>'+"1. An ongoing attempt by neuroscientists to understand how the human brain works, known as cognitive neuroscience."+'<br><br>'+"2. A thought experiment in the philosophy of artificial intelligence, demonstrating that it is possible, at least in theory, to create a machine that has all the capabilities of a human being."+'<br><br>'+"3. A long term project to create machines exhibiting behavior comparable to those of animals with complex central nervous system such as mammals and most particularly humans. The ultimate goal of creating a machine exhibiting human-like behavior or intelligence is sometimes called strong AI."+'<br><br>'+"An example of the first objective is the project reported by Aston University in Birmingham, England[2] where researchers are using biological cells to create 'neurospheres' (small clusters of neurons) in order to develop new treatments for diseases including Alzheimer's, motor neurone and Parkinson's disease."+'<br><br>'+"The second objective is a reply to arguments such as John Searle's Chinese room argument, Hubert Dreyfus' critique of AI or Roger Penrose's argument in The Emperor's New Mind. These critics argued that there are aspects of human consciousness or expertise that can not be simulated by machines. One reply to their arguments is that the biological processes inside the brain can be simulated to any degree of accuracy. This reply was made as early as 1950, by Alan Turing in his classic paper 'Computing Machinery and Intelligence'."+'<br><br>'+'The third objective is generally called artificial general intelligence by researchers.[4] However, Ray Kurzweil prefers the term "strong AI". In his book The Singularity is Near, he focuses on whole brain emulation using conventional computing machines as an approach to implementing artificial brains, and claims (on grounds of computer power continuing an exponential growth trend) that this could be done by 2025. Henry Markram, director of the Blue Brain project (which is attempting brain emulation), made a similar claim (2020) at the Oxford TED conference in 2009.',
		links: "https://en.wikipedia.org/wiki/Artificial_brain"
	},
	{	title: "Educational robotics",
		summary: "Educational robotics teaches the design, analysis, application and operation of robots. Robots include articulated robots, mobile robots or autonomous vehicles. Educational robotics can be taught from elementary school to graduate programs. Robotics may also be used to motivate and facilitate the instruction other, often foundational, topics such as computer programming, artificial intelligence or engineering design.",
		links: "https://en.wikipedia.org/wiki/Educational_robotics"
	},
	{	title: "Wired intelligence",
		summary: 'The term wired intelligence refers to a robot that has no programmed microprocessor. Instead, the robot has a particular connection of wires and analog electronics between its sensors and motors that gives it seemingly intelligent actions. These actions can be complex enough to create a quadruped robot that seeks out the brightest light source.'
		+'<br><br>'+
		'The groundwork for these theories is laid in "Vehicles: Experiments in Synthetic Psychology" by Valentino Braitenberg.',
		links: "https://en.wikipedia.org/wiki/Wired_intelligence"
	},
	{	title: "Sociorobotics",
		summary: 'Sociorobotics is a field of research studying the implications, complexities and subsequent design of artificial social, spatial, cultural and haptic behaviours, protocols and interactions of robots with each other and with humans in equal measure. Intrinsically taking into account the structured and unstructured spaces of habitation, including industrial, commercial, healthcare, eldercare and domestic environments. This emergent perspective to robotic research encompasses and surpasses the conventions of Social robotics[1] and Artificial society/social systems research.[2] Which do not appear to acknowledge that numerous robots (humanoid and non-humanoid) and humans are increasingly inhabiting the same spaces which require similar performances and agency of social behaviour, particularly regarding the commercial emergence of workplace, personal[3] and companion robotics.',
		links: "https://en.wikipedia.org/wiki/Sociorobotics"
	},
	{	title: "Biorobotics",
		summary: 'Biorobotics covers the fields of cybernetics, bionics and even genetic engineering as a collective study.'
		+'<br><br>'+
		"Biorobotics may make robots that emulate or simulate living biological organisms mechanically or even chemically, or make biological organisms as manipulatable and functional as robots, or use biological organisms as components of robots. Biorobotics could use genetic engineering to create organisms designed by artificial means.",
		links: "https://en.wikipedia.org/wiki/Biorobotics"
	}
]

index = Math.floor(Math.random() * myData.length);

var article = myData[index];

document.getElementById("article-title").innerHTML = article.title;
document.getElementById("article-summary").innerHTML = article.summary;
document.getElementById("article-link").href = article.links;