var myData = [
	{
		title: "Health survival paradox",
		summary: 'The male-female health-survival paradox, also known as the morbidity-mortality paradox or gender paradox, is the phenomenon in which women experience more medical conditions and disability during their lives, but they unexpectedly live longer than men. It is considered a paradox because of the normal assumption that sicker people will die sooner than people who experience less disease and disability. In this case, however, the group of people that experiences the most disease and disability is the one that lives the longest.'+'<br><br>'+"Records of the female survival advantage can be traced back to the 18th century, but gained popularity and caught the eyes of researchers in the 19th century.",
		links: "https://en.wikipedia.org/wiki/Health_survival_paradox"
	},
	{
		title: "Quantum social science",
		summary: 'Quantum social science is an emerging field of interdisciplinary research which draws parallels between quantum physics and the social sciences. Although there is no settled consensus on a single approach,[1] a unifying theme is that, while the social sciences have long modelled themselves on mechanistic science, they can learn much from quantum ideas such as complementarity and entanglement. Some authors are motivated by quantum mind theories that the brain, and therefore human interactions, are literally based on quantum processes, while others are more interested in taking advantage of the quantum toolkit to simulate social behaviours which elude classical treatment. Quantum ideas have been particularly influential in psychology, but are starting to affect other areas such as international relations and diplomacy in what one 2018 paper called a “quantum turn in the social sciences.”',
		links: "https://en.wikipedia.org/wiki/Quantum_social_science"
	},
	{
		title: "Youth studies",
		summary: "Youth studies is an interdisciplinary academic field devoted to the study of the development, history, culture, psychology, and politics of youth. The field studies not only specific cultures of young people, but also their relationships, roles and responsibilities throughout the larger societies which they occupy. The field includes scholars of education, literature, history, politics, religion, sociology, and many other disciplines within the humanities and social sciences.Youth studies encourages the understanding of experiences that are predominantly manifested among young people, generalized phenomenon and social change.[1] The majority of 15- to 24-year-olds in 2008 lived in developing countries.[2] The definition of youth varies across cultural contexts.[2] The social experience and organization of time and space are important themes in youth studies. Scholars examine how neoliberalism and globalization affect how young people experience life, including in comparison to previous generations.",
		links: "https://en.wikipedia.org/wiki/Youth_studies"
	},
	{	title: "Change and continuity",
		summary: "Change and continuity is a classic dichotomy within the fields of history, historical sociology, and social sciences more broadly. The dichotomy is used to discuss and evaluate the extent to which a historical development or event represents a decisive change or whether a situation remains largely unchanged. The question of change and continuity is considered a classic discussion in the study of historical developments.[1] One example could be a discussion about how much and why the Peace of Westphalia in 1648 represents an important change in European history. The dichotomy lends itself to constructing and evaluating historical periodizations. In terms of creating and peridizations (e.g. the Enlightenment or the Victorian Era), the dichotomy can be used to discuss whether when a period should start and end. Therefore, the dichotomy is also important in relation to understanding of historical chronology.",
		links: "https://en.wikipedia.org/wiki/Change_and_continuity"
	},
	{	title: "Animal studies",
		summary: 'Animal studies is a recently recognized field in which animals are studied in a variety of cross-disciplinary ways. Scholars who engage in animal studies may be formally trained in a number of diverse fields, including geography, art history, anthropology, biology, film studies, geography, history, psychology, literary studies, museology, philosophy, communication, and sociology. They may engage with questions about literal animals, or about notions of "animality" or "brutality," employing various theoretical perspectives, including feminism, Marxist theory, and queer theory. Using these perspectives, those who engage in animal studies seek to understand both human-animal relations now and in the past, and to understand animals as beings-in-themselves, separate from our knowledge of them. Because the field is still developing, scholars and others have some freedom to define their own criteria about what issues may structure the field.',
		links: "https://en.wikipedia.org/wiki/Animal_studies"
	},
	{	title: "Modern Studies",
		summary: "Modern studies is a subject unique to the Scottish secondary school curriculum. The focus of Modern Studies is to develop learners' knowledge and understanding of contemporary political and social issues in local, Scottish, United Kingdom and international contexts."
		+'<br><br>'+
		"Modern Studies is offered both at National Qualification level and also in the Broad General Education stage of Scottish education. Pupils in primary school and up to S3 in secondary school have the opportunity to study Modern Studies concepts through the 'People in Society, Economy and Business' area of the broader Social Studies Curriculum for Excellence experiences and outcomes. [2] In the Senior Phase, Modern Studies is offered as a discrete subject. Ray Gunnion, history teacher in Brannock High School until 2004, was largely involved in introducing Modern Studies into the Scottish Education system as he felt it was a valuable subject for kids in Scotland.",
		links: "https://en.wikipedia.org/wiki/Modern_Studies"
	},
	{	title: "Zemiology",
		summary: 'Zemiology is the study of social harms. Zemiology gets its name from the Greek word ζημία zēmía, meaning "harm".[1] It originated as a critique of criminology and the notion of crime. In contrast with "individual-based harms" such as theft, the notion of social harm or social injury incorporates harms caused by nation states and corporations.[2] These ideas have received increased attention from critical academics such as neo-Marxists and feminists who have sought to create an independent field of study, separate from criminology, that studies the harms that affect individuals lives that are not considered to be criminal or are rarely criminalised such as mortgage misselling, poverty and unemployment.',
		links: "https://en.wikipedia.org/wiki/Zemiology"
	}
]

index = Math.floor(Math.random() * myData.length);

var article = myData[index];

document.getElementById("article-title").innerHTML = article.title;
document.getElementById("article-summary").innerHTML = article.summary;
document.getElementById("article-link").href = article.links;